

const timetable= [
	[ // 武大 chosen
		[ // 工作日 dayidx
			[  //基地->武大 flexOrder===1?0:1
				{
					time: "06:40",
					start: "新校区一食堂门口",
					end: "武大本部当代楼"
				}, {
					time: "08:50",
					start: "新校区新珈楼门口",
					end: "武大本部网安院"
				}, {
					time: "12:40",
					start: "新校区新珈楼门口",
					end: "武大本部网安院"
				}, {
					time: "17:00",
					start: "新校区新珈楼门口",
					end: "武大本部网安院"
				}, {
					time: "17:30",
					start: "新校区新珈楼门口",
					end: "武大本部网安院"
				}
			],
			[  // 武大->基地
				{
					time: "07:00",
					start: "武大本部网安院",
					end: "新校区新珈楼门口"
				}, {
					time: "08:30",
					start: "武大本部网安院",
					end: "新校区新珈楼门口"
				}, {
					time: "12:40",
					start: "武大本部网安院",
					end: "新校区新珈楼门口"
				}, {
					time: "15:30",
					start: "武大本部网安院",
					end: "新校区新珈楼门口"
				}, {
					time: "19:00",
					start: "武大本部当代楼",
					end: "新校区一食堂门口"
				}
			]
		],
		[ // 周末
			[//基地->武大
				{
					time: "06:40",
					start: "新校区一食堂门口",
					end: "武大本部当代楼"
				}
			], 
			[//武大->基地
				{
					time: "19:00",
					start: "武大本部当代楼",
					end: "新校区一食堂门口"
				}
			]  
		]
	],
	[ // 华科
		[ // 工作日
			[//基地->华科
				{
					time: "06:30",
					start: "基地校区二食堂门口",
					end: "主校区校史馆门口"
				}, {
					time: "12:30",
					start: "基地校区二食堂门口",
					end: "主校区校史馆门口"
				}, {
					time: "18:30",
					start: "基地校区二食堂门口",
					end: "主校区校史馆门口"
				}
			], 
			[// 华科->基地
				{
					time: "07:00",
					start: "主校区校史馆门口",
					end: "基地校区二食堂门口"
				}, {
					time: "12:50",
					start: "主校区校史馆门口",
					end: "基地校区二食堂门口"
				}, {
					time: "18:30",
					start: "主校区校史馆门口",
					end: "基地校区二食堂门口"
				}
			]  
		],
		[ // 周末
			[//基地->华科
				{
					time: "06:30",
					start: "基地校区二食堂门口",
					end: "主校区校史馆门口"
				}
			], 
			[// 华科->基地
				{
					time: "19:00",
					start: "主校区校史馆门口",
					end: "基地校区二食堂门口"
				}
			]  
		]
	]
]

function getData(idx1, idx2, idx3) {
	return timetable[idx1][idx2][idx3];
}

module.exports = {getData}